# Проект "Исследование надёжности заёмщиков"

Данный проект был выполнен в ходе обучения в Яндекс.Практикуме. Профессии "Аналитик данных" / "Специалист по Data Science".

## Описание проекта

В этом проекте предстоит разобраться влияет ли семейное положение, количество детей клиента банка на факт погашения кредита в срок. Результаты исследования будут учтены при построении модели **кредитного скоринга** — системы оценки кредитоспособности (кредитных рисков) лица, основанной на численных статистических методах. Исходные данные — статистика о платёжеспособности клиентов. 

## Цель исследования

- Определить есть ли завсисимость между количеством детей и возвратом кредита в срок;
- Определить есть ли зависимость между семейным положением и возвратом кредита в срок;
- Определить есть ли зависимость между уровнем дохода и возвратом кредита в срок;
- Исследовать как цели, для которых берется кредит, влияют на его возврат в срок.

## Задачи исследования

- Обзор данных;
- Предобработка данных;
- Создание вспомогательных датафреймов;
- Создание функций для формирования столбцов таблиц по определенным условиям.

## Исходные данные

Таблица "reliability_of_borrowers"

- `children` — количество детей в семье
- `days_employed` — общий трудовой стаж в днях
- `dob_years` — возраст клиента в годах
- `education` — уровень образования клиента
- `education_id` — идентификатор уровня образования
- `family_status` — семейное положение
- `family_status_id` — идентификатор семейного положения
- `gender` — пол клиента
- `income_type` — тип занятости
- `debt` — имел ли задолженность по возврату кредитов
- `total_income` — ежемесячный доход
- `purpose` — цель получения кредита

## Используемые библиотеки

*pandas*, *pymystem3*
